import React from 'react';
import { Link } from 'react-router-dom';
import './Goals.css';

const Goals: React.FC = () => {
  return (
    <div className="goals">
       <div className="profile__header">
        <img src="/images/logos.svg" alt="Atlas Save" className="profile__logo" />
      </div>
      <h2 className="profile__page-title">Цели</h2>
      <div className="goals__content">
        <div className="goals__empty-state">
          <h2 className="goals__empty-title">Цель не выбрана</h2>
          <p className="goals__empty-description">
          Укажите, за кого копите, тип паломничества и желаемый пакет — так вы будете видеть сумму, прогресс и путь.
          </p>
          
          <div className="goals__actions">
            <Link to="/family" className="goals__button goals__button--primary">
              Начать копить на близкого
            </Link>
            <Link to="/self-goal-steps" className="goals__button goals__button--secondary">
              Начать копить на себя
              <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
  <path d="M5.17282 21.7672C6.42514 16.572 4.93852 16.3943 4.93852 13.8735C4.93852 13.0332 5.60104 11.0214 5.69799 10.0438C5.92421 7.79773 5.36673 8.39561 7.00687 6.73124L7.10382 4.42051C7.92793 3.62872 8.33998 2.91772 9.34992 3.16819C9.96396 4.99415 8.80051 4.42051 8.6874 6.55349C9.37415 7.46647 9.83469 7.55535 10.3518 8.70263C11.0062 10.1569 10.5376 10.1408 11.7738 11.3608C13.5916 11.5709 14.6905 11.5789 15.9913 10.2701C16.1286 8.8723 15.3207 8.9935 16.1448 7.70886C16.7103 6.82819 17.2678 6.3515 18.3262 6.707C18.6736 8.08051 17.1143 8.3633 17.5991 9.89032C19.6917 10.1004 20.1764 7.21601 21.7762 7.07058C21.7762 10.1489 18.5605 10.5528 18.4878 13.0575C18.4393 14.6249 19.829 18.9393 21.2348 19.8604C22.471 17.9617 23.8041 15.8934 23.9576 13.5988C25.0322 -2.05924 4.3164 -4.91129 0.381689 8.79959C0.179702 9.5025 0.0585095 10.2135 0.00195312 10.9245V12.7424C0.349371 17.2507 3.12871 21.2097 5.17282 21.7672Z" fill="white" />
  <path d="M11.232 23.8676C16.8311 24.5301 16.2413 22.8011 15.1344 16.4264C14.6981 13.9137 14.1891 12.5886 11.2078 12.823C9.34948 15.0287 10.2867 19.3269 10.3513 21.2095C10.3998 22.6961 10.1494 22.793 11.232 23.8676ZM17.6714 22.3325C18.6086 22.2194 18.7702 22.0255 19.5296 21.4195C19.6508 20.1349 18.7702 18.0665 17.3967 17.6545C16.7503 18.8987 16.9361 21.1125 17.6714 22.3325ZM8.44458 23.399C8.44458 21.8316 8.63849 18.5917 7.83054 17.4767C6.75597 17.7918 7.08723 18.7129 7.07915 20.6762C7.07107 22.1144 6.80445 23.2536 8.44458 23.399Z" fill="white" />
</svg>
            </Link>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Goals; 